Repository: hamidjalili59/portable_accounting
Catalog: lib/core/l10n/app_*.arb
Languages: fa

# global_appName
source: Portable Accounting
fa: حسابداری همراه

# global_cancel
source: Cancel
fa: لغو

# global_delete
source: Delete
fa: حذف

# global_edit
source: Edit
fa: ویرایش

# global_save
source: Save
fa: ذخیره

# global_share
source: Share
fa: اشتراک‌گذاری

# global_confirm
source: Confirm
fa: تایید

# global_error
source: Error
fa: خطا

# global_success
source: Success
fa: موفقیت

# global_na
source: N/A
fa: نامشخص

# global_actions
source: Actions
fa: عملیات

# page_dashboard
source: Dashboard
fa: داشبورد

# page_inventory
source: Inventory
fa: انبار

# page_invoices
source: Invoices
fa: فاکتورها

# page_reports
source: Reports
fa: گزارش‌ها

# page_settings
source: Settings
fa: تنظیمات

# dashboard_last7DaysProfit
source: Last 7 Days Profit
fa: سود ۷ روز گذشته

# dashboard_bestSellingItems
source: Best-Selling Items
fa: پرفروش‌ترین کالاها

# dashboard_noChartData
source: Not enough data to show profit chart.
fa: داده‌ای برای نمایش نمودار وجود ندارد.

# dashboard_noSalesData
source: No sales data available to show top products.
fa: داده فروشی برای نمایش پرفروش‌ترین‌ها موجود نیست.

# dashboard_netProfit
source: Net Profit
fa: سود خالص

# dashboard_totalRevenue
source: Total Revenue
fa: درآمد کل

# dashboard_totalCost
source: Total Cost
fa: هزینه کل

# dashboard_totalSales
source: Total Sales
fa: تعداد کل فروش

# inventory_title
source: Inventory Management
fa: مدیریت موجودی

# inventory_addNewItem
source: Add New Item
fa: افزودن کالای جدید

# inventory_newSale
source: New Sale
fa: فروش جدید

# inventory_stock
source: Stock
fa: موجودی

# inventory_unique_items
source: Unique Items
fa: اقلام منحصر به فرد

# inventory_total_stock_value
source: Total Stock Value
fa: ارزش کل انبار

# inventory_emptyStateTitle
source: Your inventory is empty!
fa: انبار شما خالی است!

# inventory_emptyStateMessage
source: Add your first item to get started.
fa: برای شروع، اولین کالای خود را اضافه کنید.

# inventory_searchByNameHint
source: Search by name...
fa: جستجو بر اساس نام...

# inventory_item_name
source: Item Name
fa: نام کالا

# inventory_quantity
source: Quantity
fa: تعداد

# inventory_purchase_price
source: Purchase Price
fa: قیمت خرید (ریال)

# inventory_sale_price
source: Sale Price
fa: قیمت فروش (ریال)

# form_addNewItemTitle
source: Add New Item
fa: افزودن کالای جدید

# form_editItemTitle
source: Edit Item
fa: ویرایش کالا

# form_validator_pleaseEnterName
source: Please enter the item name
fa: لطفاً نام کالا را وارد کنید

# form_validator_pleaseEnterValidNumber
source: Please enter a valid number
fa: لطفاً یک عدد معتبر وارد کنید

# form_saveChanges
source: Save Changes
fa: ذخیره تغییرات

# form_imageSourceTitle
source: Choose Image Source
fa: انتخاب منبع عکس

# form_gallery
source: Gallery
fa: گالری

# form_camera
source: Camera
fa: دوربین

# invoices_emptyTitle
source: No Invoices Yet!
fa: هنوز فاکتوری ثبت نشده!

# invoices_emptyMessage
source: After your first sale, the invoice will be displayed here.
fa: پس از ثبت اولین فروش، فاکتور آن در اینجا نمایش داده می‌شود.

# invoices_createFirst
source: Create First Invoice
fa: ثبت اولین فاکتور

# invoices_invoiceNumber
source: Invoice #{id}
fa: فاکتور #{id}

# invoices_customer
source: Customer
fa: مشتری

# invoices_date
source: Date
fa: تاریخ

# reports_selectDateRange
source: Select Date Range
fa: انتخاب بازه زمانی

# reports_from
source: From: {date}
fa: از: {date}

# reports_to
source: To: {date}
fa: تا: {date}

# reports_generateButton
source: Generate Sales Report
fa: تولید گزارش فروش

# reports_initialMessage
source: Please select a date range and generate a report.
fa: لطفاً یک بازه زمانی انتخاب و گزارش را تولید کنید.

# reports_noSalesFound
source: No sales found in this date range.
fa: هیچ فروشی در این بازه زمانی یافت نشد.

# reports_totalInvoices
source: Total Invoices: {count}
fa: تعداد فاکتورها: {count}

# reports_totalRevenue
source: Total Revenue: {amount}
fa: درآمد کل: {amount}

# settings_backupTitle
source: Settings & Backup
fa: پشتیبان‌گیری و بازیابی

# settings_createBackup
source: Create Backup
fa: تهیه نسخه پشتیبان

# settings_createBackupSubtitle
source: Save a copy of your data as a file.
fa: یک نسخه از اطلاعات خود را به صورت فایل ذخیره کنید.

# settings_restoreBackup
source: Restore from Backup
fa: بازیابی از پشتیبان

# settings_restoreBackupSubtitle
source: Restore your data from a backup file.
fa: اطلاعات خود را از یک فایل پشتیبان بازگردانید.

# settings_currency
source: Currency
fa: واحد پولی

# settings_language
source: Language
fa: زبان

# settings_backupDialogTitle
source: Create Backup
fa: تهیه نسخه پشتیبان

# settings_backupDialogMessage
source: How would you like to back up your data?
fa: چگونه می‌خواهید از اطلاعات خود پشتیبان‌گیری کنید؟

# settings_saveToDownloads
source: Save to Downloads
fa: ذخیره در دانلودها

# settings_backupSuccessMessage
source: Backup saved successfully to: {path}
fa: پشتیبان با موفقیت در مسیر زیر ذخیره شد: {path}

# settings_backupErrorMessage
source: Error creating backup: {error}
fa: خطا در تهیه پشتیبان: {error}

# settings_restoreWarningTitle
source: Restore Warning
fa: هشدار بازیابی

# settings_restoreWarningMessage
source: Restoring data will erase all current data and replace it with the backup file. The app must be restarted after restoring. Do you want to continue?
fa: بازیابی اطلاعات، تمام داده‌های فعلی را پاک کرده و اطلاعات فایل پشتیبان را جایگزین می‌کند. برنامه باید مجدداً راه‌اندازی شود. آیا ادامه می‌دهید؟

# settings_restoreConfirmButton
source: Confirm & Restore
fa: تایید و بازیابی

# settings_restoreSuccessTitle
source: Restore Successful
fa: بازیابی موفق

# settings_restoreSuccessMessage
source: Data was restored successfully. Please close and reopen the app to apply the changes.
fa: اطلاعات با موفقیت بازیابی شد. لطفاً برای اعمال تغییرات، برنامه را ببندید و دوباره باز کنید.

# settings_iUnderstandButton
source: I Understand
fa: متوجه شدم

# settings_restoreErrorMessage
source: Error restoring or no file was selected.
fa: خطا در بازیابی یا فایلی انتخاب نشد.

# createInvoice_title
source: Create New Invoice
fa: ایجاد فاکتور جدید

# createInvoice_exitConfirmTitle
source: Exit Confirmation
fa: تایید خروج

# createInvoice_exitConfirmMessage
source: You have items in your invoice. Are you sure you want to exit and discard them?
fa: آیتم‌هایی در فاکتور شما وجود دارد. آیا از خروج و لغو آنها مطمئن هستید؟

# createInvoice_stay
source: Stay
fa: ماندن

# createInvoice_exit
source: Exit
fa: خروج

# createInvoice_successSnackbar
source: Invoice created successfully!
fa: فاکتور با موفقیت ایجاد شد!

# createInvoice_initializing
source: Initializing...
fa: در حال آماده‌سازی...

# createInvoice_addItemButton
source: Add Item to Invoice
fa: افزودن کالا به فاکتور

# createInvoice_availableItems
source: Available Items
fa: کالاهای موجود

# createInvoice_inStock
source: In Stock: {quantity}
fa: موجودی: {quantity}

# createInvoice_currentInvoice
source: Current Invoice
fa: فاکتور فعلی

# createInvoice_noItemsSelected
source: No items selected.
fa: هیچ کالایی انتخاب نشده است.

# createInvoice_itemSubtitle
source: {quantity} x {price}
fa: {quantity} عدد × {price}

# createInvoice_customerNameHint
source: Customer Name (Optional)
fa: نام مشتری (اختیاری)

# createInvoice_total
source: Total:
fa: جمع کل:

# createInvoice_submitButton
source: Submit Invoice
fa: ثبت فاکتور

# dialog_deleteConfirmTitle
source: Confirm Deletion
fa: تایید حذف

# dialog_deleteConfirmMessage
source: Are you sure you want to delete "{itemName}"?
fa: آیا از حذف "{itemName}" مطمئن هستید؟

# dialog_discardChangesTitle
source: Discard Changes?
fa: نادیده گرفتن تغییرات؟

# dialog_discardChangesMessage
source: You have unsaved changes. Are you sure you want to go back?
fa: تغییرات ذخیره نشده‌ای وجود دارد. آیا از بازگشت مطمئن هستید؟

# global_stay
source: Stay
fa: ماندن

# global_discard
source: Discard
fa: نادیده گرفتن

# inventory_controls_searchHint
source: Search by name...
fa: جستجو بر اساس نام...

# inventory_controls_sortByNameAsc
source: Name (A-Z)
fa: نام (صعودی)

# inventory_controls_sortByNameDesc
source: Name (Z-A)
fa: نام (نزولی)

# inventory_controls_sortByQuantityAsc
source: Quantity (Low-High)
fa: تعداد (کم به زیاد)

# inventory_controls_sortByQuantityDesc
source: Quantity (High-Low)
fa: تعداد (زیاد به کم)

# global_image
source: Image
fa: تصویر
